Revit 2027 API
BuiltInFailures.StairRampFailures.RailCurveTooShort Property
 Curve in rail sketch is too short for rail creation and ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailCurveTooShort { get; }
Public Shared ReadOnly Property RailCurveTooShort As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailCurveTooShort {
	FailureDefinitionId^ get ();
}
static member RailCurveTooShort : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace